---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.NumberSystemReference
source: html/cc3719e9-9e11-f990-5292-d758731fa3a9.htm
---
# Autodesk.Revit.DB.ParameterTypeId.NumberSystemReference Property

"Reference"

## Syntax (C#)
```csharp
public static ForgeTypeId NumberSystemReference { get; }
```